legacy/splash-legacy/Resources/Template_Cases/splashThings/0/U
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);

boundaryField 
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    
    outlet
    {
        type inletOutlet;
        inletValue uniform (0 0 0);
        value uniform (0 0 0);
    }
    
    front
    {
        type symmetry;
    }
    
    back
    {
        type symmetry;
    }
    
    bottom
    {
        type symmetry;
    }
    
    top
    {
        type symmetry;
    }
    
    "geom.*"
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    
}