legacy/splash-legacy/Resources/Template_Cases/splashThings/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
ddtSchemes
{
    default steadyState;
}
gradSchemes
{
    default Gauss linear;
    grad(p) Gauss linear;
    grad(U) cellLimited Gauss linear 1;
}
divSchemes
{
    default Gauss linear;
    div(phi,U) Gauss linearUpwind grad(U); 
    div(phi,k) Gauss upwind;
    div(phi,omega) Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,nuTilda) Gauss upwind;
    div(phi,nut) Gauss upwind;
    div(nuEff*dev(T(grad(U)))) Gauss linear;
}
laplacianSchemes
{
    default Gauss linear limited 0.667;
}
interpolationSchemes
{
    default linear;
}
snGradSchemes
{
    default limited 0.667;
}
fluxRequired
{
    default no;
}
wallDist
{
    method meshWave;
}
