legacy/splash-legacy/Resources/Template_Cases/splashThings/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
solvers
{
    
U
{
    solver smoothSolver;
    smoother GaussSeidel;
    tolerance 1e-08;
    relTol 0.1;
    maxIter 100;
}

UFinal
{
    $U
    tolerance 1e-10;
    relTol 0;  
}

p
{
    solver GAMG;
    smoother GaussSeidel;
    
    agglomerator faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels 1;
    cacheAgglomeration true;
    tolerance 1e-07;
    relTol 0.01;
    maxIter 100;
    nSweeps 1;
    nPreSweeps 0;
}

pFinal
{
    $p
    tolerance 9.999999999999999e-10;
    relTol 0;  
}

k
{
    solver smoothSolver;
    smoother GaussSeidel;
    tolerance 1e-08;
    relTol 0.1;
    maxIter 100;
}

kFinal
{
    $k
    tolerance 1e-10;
    relTol 0;  
}

omega
{
    solver smoothSolver;
    smoother GaussSeidel;
    tolerance 1e-08;
    relTol 0.1;
    maxIter 100;
}

omegaFinal
{
    $omega
    tolerance 1e-10;
    relTol 0;  
}

epsilon
{
    solver smoothSolver;
    smoother GaussSeidel;
    tolerance 1e-08;
    relTol 0.1;
    maxIter 100;
}

epsilonFinal
{
    $epsilon
    tolerance 1e-10;
    relTol 0;  
}

nuTilda
{
    solver smoothSolver;
    smoother GaussSeidel;
    tolerance 1e-08;
    relTol 0.1;
    maxIter 100;
}

nuTildaFinal
{
    $nuTilda
    tolerance 1e-10;
    relTol 0;  
}

nut
{
    solver smoothSolver;
    smoother GaussSeidel;
    tolerance 1e-08;
    relTol 0.1;
    maxIter 100;
}

nutFinal
{
    $nut
    tolerance 1e-10;
    relTol 0;  
}

Phi
{
    solver GAMG;
    smoother GaussSeidel;
    
    agglomerator faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels 1;
    cacheAgglomeration true;
    tolerance 1e-08;
    relTol 0.01;
    maxIter 100;
    nSweeps 1;
    nPreSweeps 0;
}

PhiFinal
{
    $Phi
    tolerance 1e-10;
    relTol 0;  
}

}
    
PIMPLE
{
    nOuterCorrectors 20;
    nCorrectors 1;
    nNonOrthogonalCorrectors 1;
    pRefCell 0;
    pRefValue 0;
    residualControl
    {
        "(U|k|omega|epsilon|nuTilda|nut)" 
        {
            tolerance 0.001;
            relTol 0;
        }
        p
        {
            tolerance 0.001;
            relTol 0;
        }
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent false;
    residualControl
    {
        U 0.0001;
        p 0.0001;
        k 0.0001;
        omega 0.0001;
        epsilon 0.0001;
        nut 0.0001;
        nuTilda 0.0001;
    }
}
potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
relaxationFactors
{
    equations
    {
        U 0.7;
        
        k 0.7;
        omega 0.7;
        epsilon 0.7;
        nuTilda 0.7;
        nut 0.7;
    }
    fields
    {
        p 0.3;
    }
}
