legacy/splash-legacy/Resources/Template_Cases/splashThings/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{

    geom.stl
    {
        type triSurfaceMesh;
        name geom;
        regions
        {
            geom
            {
                name geom;
            }
        }
    }
    refinementBox
    {
        type searchableBox;
        min (-2.4 -3.0 -3.0);
        max (31.0 3.0 3.0);
    }
    fineBox
    {
        type searchableBox;
        min (-1.4 -1.9 -1.9);
        max (7.0 1.9 1.9);
    }
    refinementBox
    {
        type searchableBox;
        min (-2.4 -3.0 -3.0);
        max (31.0 3.0 3.0);
    }
    fineBox
    {
        type searchableBox;
        min (-1.4 -1.9 -1.9);
        max (7.0 1.9 1.9);
    }
    groundBox
    {
        type searchableBox;
        min (-1000.0 -1000 -1.4);
        max (1000.0 1000 -0.6);
    }
    
}
castellatedMeshControls
{
    maxLocalCells 10000000;
    maxGlobalCells 50000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 5;
    features
    (
        
                
        {
            file "geom.eMesh";
            level 2;
        }
    );
    refinementSurfaces
    {
        
        geom
        {
            level (0 0);
            regions
            {
                geom
                {
                    level (2 2);
                    patchInfo
                    {
                        type wall;
                    }
                }
            } 
        }
    }
    resolveFeatureAngle 25;
    refinementRegions
    {
        
        refinementBox
        {
            mode inside;
            levels ((1E15 1)); 
        }
        fineBox
        {
            mode inside;
            levels ((1E15 2)); 
        }
        refinementBox
        {
            mode inside;
            levels ((1E15 1)); 
        }
        fineBox
        {
            mode inside;
            levels ((1E15 2)); 
        }
        groundBox
        {
            mode inside;
            levels ((1E15 2)); 
        }
    };
    locationInMesh (0.000 0.000 0.000);
    allowFreeStandingZoneFaces false;
}
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 50;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}
addLayersControls
{
    relativeSizes true;
    layers
    {
            "geom.*"
            {
                nSurfaceLayers 12;
            }
            "bottom"
            {
                nSurfaceLayers 3;
            }
    };
    expansionRatio 1.25;
    finalLayerThickness 0.5;
    //firstLayerThickness 0.001;
    minThickness 0.005;
    nGrow 0;
    featureAngle 180;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}
meshQualityControls
{
    maxNonOrtho 70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-30;
    minTetQuality 1e-30;
    minArea 1e-30;
    minTwist 0.001;
    minDeterminant 0.001;
    minFaceWeight 0.001;
    minVolRatio 0.001;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);
debug 0;
mergeTolerance 1e-06;