legacy/splash-legacy/Resources/Template_Cases/splashThings/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
geom.stl
{
    extractionMethod    extractFromSurface; 
    includedAngle   170;
    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges       yes;
    }
    writeObj            yes;
    writeSets           no;
}